"""
Дан список чисел. Определите, сколько в нем встречается различных чисел.

Input: [1, 1, 2, 0, -1, 3, 4, 4]

Output: 6
"""
n = [1, 1, 2, 0, -1, 3, 4, 4]

# print(set(n))
print(len(set(n)))

my_set = {12, 'saf', 456, 45.4}
print(my_set)